üìé [Haz clic aqu√≠ para acceder a mi notebook en Google Drive](https://drive.google.com/file/d/19lu3Mf7nVyoaaFR8iW-Ycg5TpDOeqsbh/view?usp=drive_link)

üìé [Haz clic aqu√≠ para ver la presentaci√≥n en PDF](https://drive.google.com/file/d/1HOZ1TFqna5pYKXfqWaC64biZDbL861C8/view?usp=drive_link)

üìä [Haz clic aqu√≠ para ver el dashboard en Tableau Public](https://public.tableau.com/app/profile/dante.dupeyron/viz/DashboarddeAnlisisdeLibrosDigitales/Dashboard1)

# Proyecto Final de SQL ‚Äî An√°lisis de Libros

Durante la pandemia del coronavirus, la vida cotidiana cambi√≥ dr√°sticamente. Muchas personas dejaron de salir y comenzaron a pasar m√°s tiempo en casa, lo cual increment√≥ el inter√©s por la lectura. Esto atrajo la atenci√≥n de startups que decidieron lanzar nuevas aplicaciones para lectores.

En este proyecto, analizaremos una base de datos de uno de estos servicios. Los datos incluyen informaci√≥n sobre libros, autores, editoriales, rese√±as y calificaciones de usuarios. El objetivo es explorar estos datos y extraer conclusiones clave que ayuden a generar una propuesta de valor para un nuevo producto.

---

## Objetivos del estudio

1. Conectarnos correctamente a la base de datos.
2. Explorar el contenido de cada tabla para entender su estructura.
3. Responder las siguientes preguntas de negocio con SQL:
   - ¬øCu√°ntos libros fueron publicados despu√©s del 1 de enero de 2000?
   - ¬øCu√°l es el n√∫mero de rese√±as y la calificaci√≥n promedio por libro?
   - ¬øQu√© editorial public√≥ m√°s libros con m√°s de 50 p√°ginas?
   - ¬øQu√© autor tiene la calificaci√≥n promedio m√°s alta considerando solo libros con al menos 50 calificaciones?
   - ¬øCu√°l es el n√∫mero promedio de rese√±as de texto entre los usuarios que calificaron m√°s de 50 libros?

---

## Descripci√≥n de las tablas

### books
- `book_id`: identificaci√≥n del libro  
- `author_id`: identificaci√≥n del autor o autora  
- `title`: t√≠tulo del libro  
- `num_pages`: n√∫mero de p√°ginas  
- `publication_date`: fecha de publicaci√≥n  
- `publisher_id`: identificaci√≥n de la editorial  

### authors
- `author_id`: identificaci√≥n del autor o autora  
- `author`: nombre del autor o autora  

### publishers
- `publisher_id`: identificaci√≥n de la editorial  
- `publisher`: nombre de la editorial  

### ratings
- `rating_id`: identificaci√≥n de la calificaci√≥n  
- `book_id`: identificaci√≥n del libro  
- `username`: nombre del usuario  
- `rating`: calificaci√≥n otorgada (entero)  

### reviews
- `review_id`: identificaci√≥n de la rese√±a  
- `book_id`: identificaci√≥n del libro  
- `username`: nombre del usuario  
- `text`: contenido de la rese√±a

---

## Herramientas utilizadas

- PostgreSQL para consultas SQL
- SQLAlchemy para conexi√≥n
- pandas para visualizaci√≥n de resultados

---

In [5]:
# Importar librerias 
import pandas as pd
from sqlalchemy import create_engine

In [6]:
# Configuraci√≥n para conectarse a la base de datos
db_config = {
    'user': 'practicum_student',  # nombre de usuario
    'pwd': 'QnmDH8Sc2TQLvy2G3Vvh7',  # contrase√±a
    'host': 'yp-trainers-practicum.cluster-czs0gxyx2d8w.us-east-1.rds.amazonaws.com',  # host
    'port': 5432,  # puerto de conexi√≥n
    'db': 'data-analyst-final-project-db'  # nombre de la base de datos
}

# Construimos la cadena de conexi√≥n
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(
    db_config['user'],
    db_config['pwd'],
    db_config['host'],
    db_config['port'],
    db_config['db']
)

In [7]:
# Creamos la conexi√≥n con la base de datos
engine = create_engine(connection_string, connect_args={'sslmode': 'require'})

# Exploraci√≥n de las tablas

Antes de comenzar con las consultas, vamos a explorar los primeros registros de cada tabla para entender su contenido y estructura.

In [8]:
# Exploramos books
query = 'SELECT * FROM books LIMIT 5'
pd.read_sql(query, con=engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [9]:
# Exploramos authors
query = 'SELECT * FROM authors LIMIT 5'
pd.read_sql(query, con=engine)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [10]:
# Exploramos publishers
query = 'SELECT * FROM publishers LIMIT 5'
pd.read_sql(query, con=engine)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [11]:
# Exploramos ratings
query = 'SELECT * FROM ratings LIMIT 5'
pd.read_sql(query, con=engine)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [12]:
# Exploramos reviews
query = 'SELECT * FROM reviews LIMIT 5'
pd.read_sql(query, con=engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

# ¬øCu√°ntos libros fueron publicados despu√©s del 1 de enero de 2000?

In [13]:
# Total de libros en la tabla
query = '''
SELECT COUNT(*) AS total_books 
FROM books
'''
pd.read_sql(query, con=engine)

   total_books
0         1000

In [14]:
# Contamos los libros publicados despu√©s del 1 de enero de 2000
query = '''
SELECT COUNT(*) AS books_published_after_2000
FROM books
WHERE publication_date > '2000-01-01'
'''
pd.read_sql(query, con=engine)

   books_published_after_2000
0                         819

Se identificaron **819 libros publicados despu√©s del 1 de enero del a√±o 2000**.

# ¬øCu√°l es el n√∫mero de rese√±as de usuarios y la calificaci√≥n promedio para cada libro?

In [15]:
query = '''
SELECT 
    b.book_id,
    b.title,
    COUNT(rt.rating_id) AS num_ratings,
    ROUND(AVG(rt.rating), 2) AS avg_rating
FROM books b
JOIN ratings rt ON b.book_id = rt.book_id
GROUP BY b.book_id, b.title
HAVING COUNT(rt.rating_id) >= 50
ORDER BY avg_rating DESC
'''
pd.read_sql(query, con=engine)

,book_id,title,num_ratings,avg_rating
0,302,Harry Potter and the Prisoner of Azkaban (Harr...,82,4.41
1,722,The Fellowship of the Ring (The Lord of the Ri...,74,4.39
2,299,Harry Potter and the Chamber of Secrets (Harry...,80,4.29
3,656,The Book Thief,53,4.26
4,300,Harry Potter and the Half-Blood Prince (Harry ...,73,4.25
5,301,Harry Potter and the Order of the Phoenix (Har...,75,4.19
6,399,Little Women,52,4.19
7,750,The Hobbit or There and Back Again,88,4.13
8,779,The Lightning Thief (Percy Jackson and the Oly...,62,4.08
9,405,Lord of the Flies,71,3.90
10,673,The Catcher in the Rye,86,3.83
11,696,The Da Vinci Code (Robert Langdon #2),59,3.83
12,545,Romeo and Juliet,66,3.79
13,627,The Alchemist,57,3.79
14,733,The Giver (The Giver #1),56,3.75
15,79,Animal Farm,74,3.73
16,75,Angels & Demons (Robert Langdon #1),84,3.68
17,948,Twilight (Twilight #1),160,3.66
18,488,Of Mice and Men,61,3.62

Los libros con m√°s calificaciones y mejores promedios incluyen t√≠tulos ampliamente reconocidos como *Harry Potter*, *El Se√±or de los Anillos* y *The Book Thief*. Estos resultados confirman que los t√≠tulos m√°s populares tambi√©n tienden a tener una alta valoraci√≥n, lo cual puede guiar futuras recomendaciones editoriales.

> Nota: Aunque la pregunta no ped√≠a un filtro expl√≠cito, se incluy√≥ `HAVING COUNT(rating_id) >= 50` para asegurar que los libros analizados tengan una base estad√≠stica s√≥lida. Esto evita destacar libros con solo 1 o 2 calificaciones, que podr√≠an distorsionar los resultados.

# ¬øQu√© editorial ha publicado el mayor n√∫mero de libros con m√°s de 50 p√°ginas?

In [16]:
# Editorial con m√°s libros de m√°s de 50 p√°ginas
query = '''
SELECT 
    p.publisher,
    COUNT(b.book_id) AS books_over_50_pages
FROM books b
JOIN publishers p ON b.publisher_id = p.publisher_id
WHERE b.num_pages > 50
GROUP BY p.publisher
ORDER BY books_over_50_pages DESC
LIMIT 5
'''
pd.read_sql(query, con=engine)

                  publisher  books_over_50_pages
0             Penguin Books                   42
1                   Vintage                   31
2  Grand Central Publishing                   25
3          Penguin Classics                   24
4                    Bantam                   19

**Penguin Books** es la editorial con m√°s libros de m√°s de 50 p√°ginas, con un total de **42 publicaciones** sustanciales. Esto indica que tiene un cat√°logo amplio y confiable.

# ¬øQu√© autor tiene la calificaci√≥n promedio m√°s alta, considerando solo libros con al menos 50 calificaciones?

In [17]:
query = '''
WITH rated_books AS (
    SELECT 
        book_id,
        COUNT(rating_id) AS rating_count,
        AVG(rating) AS avg_rating
    FROM ratings
    GROUP BY book_id
    HAVING COUNT(rating_id) >= 50
)

SELECT 
    a.author_id,
    a.author,
    COUNT(rb.book_id) AS qualified_books,
    ROUND(AVG(rb.avg_rating), 2) AS author_avg_rating
FROM rated_books rb
JOIN books b ON rb.book_id = b.book_id
JOIN authors a ON b.author_id = a.author_id
GROUP BY a.author_id, a.author
ORDER BY author_avg_rating DESC
LIMIT 10
'''
pd.read_sql(query, con=engine)

,author_id,author,qualified_books,author_avg_rating
0,236,J.K. Rowling/Mary GrandPr√©,4,4.28
1,240,J.R.R. Tolkien,2,4.26
2,402,Markus Zusak/Cao Xu√¢n Vi·ªát Kh∆∞∆°ng,1,4.26
3,376,Louisa May Alcott,1,4.19
4,498,Rick Riordan,1,4.08
5,621,William Golding,1,3.90
6,235,J.D. Salinger,1,3.83
7,469,Paulo Coelho/Alan R. Clarke/√ñzdemir ƒ∞nce,1,3.79
8,630,William Shakespeare/Paul Werstine/Barbara A. M...,1,3.79
9,372,Lois Lowry,1,3.75

El autor con la mejor calificaci√≥n promedio, considerando √∫nicamente libros con al menos 50 calificaciones, es **J.K. Rowling/Mary GrandPr√©** con un promedio de **4.28 en 4 libros**. Esto demuestra no solo popularidad, sino tambi√©n calidad sostenida en m√∫ltiples obras.

# ¬øCu√°l es el n√∫mero promedio de rese√±as de texto entre los usuarios que calificaron m√°s de 50 libros?

In [18]:
# Promedio de rese√±as de texto entre usuarios que calificaron m√°s de 50 libros
query = '''
WITH active_users AS (
    SELECT username
    FROM ratings
    GROUP BY username
    HAVING COUNT(book_id) > 50
),

reviews_count AS (
    SELECT r.username, COUNT(r.review_id) AS total_reviews
    FROM reviews r
    JOIN active_users au ON r.username = au.username
    GROUP BY r.username
)

SELECT ROUND(AVG(total_reviews), 2) AS avg_reviews_per_active_user
FROM reviews_count
'''
pd.read_sql(query, con=engine)

   avg_reviews_per_active_user
0                        24.33

Los usuarios que han calificado m√°s de 50 libros han escrito en promedio **24.33 rese√±as de texto**. Esto refleja un alto nivel de participaci√≥n activa en la plataforma.

# Conclusi√≥n Final

Este proyecto permiti√≥ analizar el comportamiento de usuarios, libros, autores y editoriales en una plataforma de lectura digital. Al aplicar filtros estad√≠sticos, obtuvimos resultados claros y representativos.

Entre los hallazgos clave:
- La mayor√≠a de los libros publicados son posteriores al a√±o 2000.
- J.K. Rowling y Tolkien destacan por la calidad sostenida de sus obras.
- Penguin Books lidera en volumen de publicaciones sustanciales.
- Los usuarios m√°s activos tambi√©n generan contenido valioso a trav√©s de rese√±as.

Este tipo de an√°lisis es esencial para definir estrategias de producto, recomendaciones y alianzas dentro del sector editorial digital.